#ifndef APP_DIAGNOSTICS_H
#define APP_DIAGNOSTICS_H

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @brief Функция вывода информации об общей куче (Heap) системы.
 * @note Безопасна для вызова из любого места прошивки.
 */
void diag_log_system_heap(void);

/**
 * @brief Функция контроля стека текущей FreeRTOS-задачи.
 * @note Должна вызываться ИЗНУТРИ цикла самой контролируемой задачи.
 */
void diag_log_current_task_stack(void);

#ifdef __cplusplus
}
#endif

#endif // APP_DIAGNOSTICS_H

// Если значение близко к 0 (например, меньше 100–200 байт): Задача на грани
// краха (Stack Overflow). Срочно увеличьте размер буфера стека этой задачи при
// её создании на 512 или 1024 байта

// Если значение слишком большое (например, пишет 2500 байт): Это значит, что вы
// выделили задаче слишком много памяти, которая никогда не используется. Вы
// можете безопасно уменьшить размер её стека на 2000 байт, сохранив около 500
// байт в качестве безопасного резерва на случай глубоких вызовов ESP_LOG или
// математических функций.